---
kind: type
id: T:Autodesk.Revit.DB.Transform
zh: 变换
source: html/58dd01c8-b3fc-7142-e4f3-c524079a282d.htm
---
# Autodesk.Revit.DB.Transform

**中文**: 变换

A transformation of the affine 3-space.

## Syntax (C#)
```csharp
public class Transform : APIObject
```